# 01. 데이터 불러오기

In [26]:
import pandas as pd
customerData = pd.read_csv("../Python_ST_EX/dataset/customerdata.csv")
customerData.head(2)

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566    4273.90000    3          6.4    1.679181  Big-Screen-lover
1  A14219    3642.44195    2          4.0    2.682023      Sleeping-dog

# 02. 각 데이터의 타입 조회  (object = 문자)

In [8]:
customerData.dtypes

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT     float64
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

# 03.데이터 타입 변환

In [9]:
#연산시 형이 다르면 계산이 불가하니까
customerData["DEVICECOUNT"] = customerData["DEVICECOUNT"].astype(int)
print(customerData.dtypes)

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT       int32
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

# 04.  원하는 행 조회하기

In [27]:
#03에서 int 로 바꿔서 정수로 출력된거야
answer1 = customerData[ (customerData.EMI==3) & (customerData.DEVICECOUNT>5) ]
answer1.head(2)

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0   A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
27  F17131   3179.708359    3          6.5    1.100000        Early-bird

# 05. (quiz) kopo_customerdata 데이터에서 gender == male 이면서 email > 0 인 데이터를 추출하세요

In [28]:
import pandas as pd
customerData = pd.read_csv("../Python_ST_EX/dataset/kopo_customerdata.csv")
customerData.head(2)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0

In [29]:
answer1 = customerData[(customerData.GENDER == "Male") & (customerData.EMAIL>0)]
answer1.head(2)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0

In [ ]:
import pandas as pd
customerData = pd.read_csv("../Python_ST_EX/dataset/kopo_customerdata.csv")
customerData.head(2)

In [50]:
targetGender = "Female"

In [52]:
targetGender = targetGender.upper()
targetGender

'FEMALE'

In [ ]:
#대소문자를 상관하지 않고 출력할 수 있게

In [53]:
targetEmail = 0

In [54]:
#컬럼에서 스트링함수를 쓰려면 .str을 입력해야함
answer1 = customerData[(customerData.GENDER.str.upper() == targetGender) & (customerData.EMAIL>targetEmail)]
answer1.head(5)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
161,1903089,State2,2,Female,1,2,1,3,101500,47000,54500,0,0,0,4,354
901,1130773,State2,2,Female,1,2,1,0,70900,0,70900,0,0,0,1,0
1188,384925,State2,2,Female,0,2,1,1,70600,0,70600,0,0,0,1,0
1248,1439246,State2,2,Female,1,2,1,1,59600,42900,0,16700,0,0,2,595
1592,2244756,State2,2,Female,1,2,1,1,28300,0,0,28300,0,0,1,0

# 실습2

In [56]:
import pandas as pd
productVolume = pd.read_csv("../Python_ST_EX/dataset/kopo_product_volume.csv")
productVolume.head(5)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464
3      A01       ST0002    201418  134467
4      A01       ST0001    201413  470040

In [57]:
answer1 = customerData[(productVolume.PRODUCTGROUP == "ST0002") &
                       (productVolume.VOLUME>300000)]
answer1.head(5)

    REGIONID PRODUCTGROUP  YEARWEEK   VOLUME
80       A01       ST0002    201452   422468
86       A01       ST0002    201451   356271
90       A01       ST0002    201449   669711
94       A01       ST0002    201447   378339
102      A01       ST0002    201448  1400339

In [59]:
answer2 = customerData.query('PRODUCTGROUP == "ST0002" and VOLUME > 300000')
answer2.head(5)

    REGIONID PRODUCTGROUP  YEARWEEK   VOLUME
80       A01       ST0002    201452   422468
86       A01       ST0002    201451   356271
90       A01       ST0002    201449   669711
94       A01       ST0002    201447   378339
102      A01       ST0002    201448  1400339